<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Editando m&aacute;scaras y filtros</title>
<link href="HelpStyle.css" rel="stylesheet" media="all">
<meta name="description" content="Explica como editar máscaras y filtros.">
<meta name="keywords" content="máscara, filtro, editar">
</head>
<body>

<div id="caticon">
<img src="images/GrandPerspectiveIcon32.png" alt="GrandPerspective icon" height="32" width="32">
</div>
<div id="pagetitle">
<h1>Editando m&aacute;scaras y filtros</h1>
</div>

<p>Una ventana "Editar m&aacute;scara" o "Editar filtro" aparece cuando necesitas especificar respectivamente una <a href="MasksAndFilters.html">m&aacute;scara o filtro</a>.
La ventana contiene dos listas.
La lista de la izquierda muestra las reglas que has usado en la m&aacute;scara o el filtro.
La lista de la derecha muestra todas las reglas que est&aacute;n disponibles. 
Puedes seleccionar las reglas que deben ser usadas moviendolas desde la derecha a la izquierda, usando el bot&oacute;n &lt;.</p>

<p> Cuando hay m&aacute;s de una regla en la m&aacute;scara (o filtro), un archivo solo necesita aplicar una coincidencia en la m&aacute;scara (o filtro).
  En otras palabras, las reglas son combinadas usando &quot;O&quot; en vez de &quot;Y&quot;.</p>
<p>La mayor&iacute;a de las reglas solo se aplican a archivos, pero algunas (tambi&eacute;n) se aplican a las carpetas. Cuando una carpeta no debe mostrarse, ninguno de sus contenidos ser&aacute; mostrado. Cuando se est&eacute; usando uno o m&aacute;s reglas que (tambi&eacute;n) se aplica a carpetas, es raro que tenga sentido &quot;solo mostrar&quot; elementos coincidentes con las reglas. La raz&oacute;n es que un archivo solo ser&aacute; mostrado cuando <em>todas las carpetas en su ruta</em> (comenzando con la carpeta que es escaneada) coincidan con una de las reglas.</p>
<p>GrandPersepective viene con unas pocas reglas por defecto para m&aacute;scaras y filtros. Puedes crear tus propias reglas usando el bot&oacute;n <b>Nueva</b>, o modificando una regla existente usando el bot&oacute;n <b>Editar.</b> En los dos casos, una nueva ventana &quot;Editar regla de filtro&quot; aparecer&aacute; donde podr&aacute;s <a href="EditingMaskAndFilterRules.html">editar la regla</a>. Las reglas que crees o modifiques son mantenidas en el repositorio de reglas, que es autom&aacute;ticamente almacenado en tus preferencias. De esta manera estar&aacute;n disponibles la pr&oacute;xima vez que ejecutes GrandPerspective.</p>
<p>Puedes eliminar reglas que hayas creado, usando el bot&oacute;n <b>Eliminar</b>. Puesdes, tambi&eacute;n, usar este bot&oacute;n para deshacer los cambios que hayas realizado a las reglas por defecto de la aplicaci&oacute;n. La regla ser&aacute; reemplazada por la regla original con el mismo nombre.</p>
<h2>Mirar tambi&eacute;n</h2>

<p>
<ul>
<li><a href="EditingMaskAndFilterRules.html">Editando reglas de m&aacute;scaras y filtros</a></li>
</ul>
</p>

</body>
</html>
