<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Medidas de tama&ntilde;o de archivo</title>
<link href="HelpStyle.css" rel="stylesheet" media="all">
<meta name="description" content="Describe las medidas de tamaño de los archivos que son soportados y explica como se pueden elegir.">
<meta name="keywords" content="archivo, tamaño, medida, lógico, físico">
</head>
<body>

<div id="caticon">
<img src="images/GrandPerspectiveIcon32.png" alt="GrandPerspective icon" height="32" width="32">
</div>
<div id="pagetitle">
<h1>Medidas de tama&ntilde;o de archivo</h1>
</div>

<p>
El &aacute;rea de cada rect&aacute;ngulo en la <a href="Views.html">ventana de vista </a>es proporcional al tama&ntilde;o de los archivos que representa.
Aqu&iacute; hay, sin embargo, m&aacute;s de una manera de medir el tama&ntilde;o de un archivo.
GrandPerspective por lo tanto soporta dos medidas diferentes de tama&ntilde;o:
<ul>
<li><strong>Tama&ntilde;o l&oacute;gico</strong>,
el cu&aacute;l corresponde con el tama&ntilde;o de la informaci&oacute;n en el archivo. 
Por ejemplo, el tama&ntilde;o l&oacute;gico de un simple archivo de texto ASCII es el n&uacute;mero de caracteres (incluyendo los espacios y lo saltos de l&iacute;nea) que contiene.</li>

<li><b>Tama&ntilde;o f&iacute;sico</b>, 
el cu&aacute;l representa el espacio que un archivo ocupa actualmente en el disco. 
Un tama&ntilde;o f&iacute;sico de archivo puede ser el mismo que el tama&ntilde;o l&oacute;gico, pero tipicamente es ligeramente mayor debido a la forma en que el archivo es almacenado. Por ejemplo un archivo con tama&ntilde;o l&oacute;gico de diez bytes puede, dependiendo del sistema de archivos, tener un tama&ntilde;o f&iacute;sico de 1024 bytes.</li>
</ul>
</p>

<p>
Por defecto, GrandPerspective informa de tama&ntilde;os l&oacute;gicos de archivos. Puedes cambiar la medida del tama&ntilde;o que es usada mediante el cambio de las  <a href="Preferences.html">Preferencias</a> de la aplicaci&oacute;n.</p>

</body>
</html>
