<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Como analizar las copias de seguridad de la M&aacute;quina del tiempo (Time Machine)</title>
<link href="HelpStyle.css" rel="stylesheet" media="all">
<meta name="description" content="Como analizar las copias de seguridad de la M&aacute;quina del tiempo (Time Machine)">
<meta name="keywords" content="Time Machine, M&aacute;quina del tiempo, copia de seguridad, analizar, como, enlace duro, hard link">
</head>
<body>

<div id="caticon">
<img src="images/GrandPerspectiveIcon32.png" alt="GrandPerspective icon" height="32" width="32">
</div>
<div id="pagetitle">
<h1>Como analizar las copias de seguridad de la M&aacute;quina del tiempo (Time Machine)</h1>
</div>

<p>GrandPerspective puede ser usado para analizar las copias de seguridad hechas por la M&aacute;quina del tiempo (Time Machine). Esto te puede ayudar a optimizar tu esquema de copias de seguridad de tu M&aacute;quina del tiempo, por ejemplo, identificando archivos y carpetas que no deban ser copiados.</p>
<p>Antes que nada, es importante como son guardadas las copias de seguridad de la M&aacute;quina del tiempo. La m&aacute;quina del tiempo hace un un uso extensivo de los <a href="HardLinks.html">hard links (enlaces duros)</a>. Cada copia de seguridad parece guardar una copia entera del dispositivo del que se realiza la copia de seguridad. La cantidad de espacio requerido para una copia de seguridad est&aacute; limitada por los archivos que son cambiados desde la copia anterior. Todos los archivos y carpetas que no han sido cambiados, son representados mediante enlaces duros a esos elementos de la copia de seguridad anterior.</p>
<p>Debajo hay algunas maneras de como puedes usar GrandPerspective para analizar tu copia de seguridad de la M&aacute;quina del Tiempo. Son solo para darte una idea de lo que puedes hacer. Por supuesto, eres libre de experimentar otras formas.</p>
<h2>Comparando copias de seguridad</h2>

<p>
Compara dos copias de seguridad para ver que ha cambiado en tu disco duro. Primero, ejecuta <b>Escanear carpeta</b> en una copia de seguridad antigua, por ejemplo <em>&quot;Backup Volume</em>/Backups.backupdb/<em>My Computer</em>/<em>2008-08-08-888888</em>&quot;. Despu&eacute;s, puedes escanear el contenido de la &uacute;ltima copia de seguridad, por ejemplo "<em>Backup Volume</em>/Backups.backupdb/<em>My Computer</em>/Latest". Teniendo ambas vistas abiertas, una al lado de la otra, te permitir&aacute; echar de un vistazo r&aacute;pido las mayores diferencias.</p>
<p>Nota: En vez de escanear la &uacute;ltima copia de seguridad, puedes escanear los contenidos actuales de tu disco duro. La parte negativa es que la vista resultante contendr&aacute; archivos que ser&aacute;n excluidos de las copias de seguridad de la M&aacute;quina del tiempo, lo que har&aacute; que sea m&aacute;s dif&iacute;cil seguir los cambios.</p>
<h2>Escaneando todas las copias de seguridad</h2>

<p>
Ejecuta  <b>Escanear carpeta</b> en la carpeta  "<em>Backup Volume</em>/Backups.backupdb/<em>My Computer</em>". Esto se tomar&aacute; su tiempo. Cuando el escaneo est&aacute; completado, la  <a href="Views.html">vista</a> mostrar&aacute; todas las copias de seguridad. En el  <a href="ViewDisplayPanel.html">Panel de visualizaci&oacute;n</a>, selecciona colorear por  "Carpeta superior". Todos los archivos pertenecientes a la misma copia de seguridad, estar&aacute;n ahora del mismo color.</p>
<p>Probablemente ver&aacute;s que una copia es mucho m&aacute;s grande que el resto. Esta es la carpeta de la copia de seguridad que fue escaneada primero (no necesariamente la m&aacute;s actual). Todos los archivos en esta carpeta no han sido encontrados antes durante el escaneo, y por eso han sido incluidos. Cuando escaneas las otras carpetas de copias de seguridad, la mayor&iacute;a de los archivos hard-linked ya habr&aacute;n sido encontrados antes en la primera carpeta que fue escaneada. y por tanto son excluidos ahora.</p>
<p>La carpeta que fue escaneada primero es la menos interesante. Ella simplemente muestra los contenidos de tu disco duro en el momento del escaneo (menos los archivos de copia de seguridad que se hayan elegido para excluir en la M&aacute;quina del Tiempo). A si que la excluiremos de la vista. Empieza editando la vista de la <a href="MasksAndFilters.html">mascara</a>. Necesitas <a href="EditingMaskAndFilterRules.html">crear una nueva regla</a>. Nombra la regla como &quot;Main back-up&quot;, aplica el filtro a &quot;archivos y carpetas&quot;, y permite la inclusi&oacute;n de comprobaci&oacute;n de la Ruta, coincidiendo las rutas que empiezan con &quot;/Volumes/<em>Backup Volume</em>/Backups.backupdb/<em>My Computer</em>/<em>2008-08-08-888888</em>". Las partes en cursiva pueden ser diferentes en tu caso. Puedes conseguir la cadena de texto que necesitas del <a href="ViewFocusPanel.html">Panel de foco</a>. Primero, en la vista, seleccione un archivo de la carpeta de la copia de seguridad m&aacute;s grande, 
<a href="NavigatingViews.html">haz zoom</a> un nivel, copia la ruta desde la caja de texto de "Carpeta en la vista", y quite zoom otra vez.</p>
<p>Despu&eacute;s de haber creado la regla &quot;Main back-up&quot;, establezca la m&aacute;scara como sigue: &quot;No mostrar: Main back-up&quot;. Debes ver ahora que la copia de seguridad principal est&aacute; enmascarada. Si no es el caso, es que no has especificado la m&aacute;scara correctamente. Editala y prueba de nuevo hasta que funcione.</p>
<p>Cuando la m&aacute;scara funcione correctamente, debes filtrar la vista. Usa el comando <strong>Filtrar</strong>. Por defecto debe estar configurado de la misma manera que la m&aacute;scara, as&iacute; que simplemente pincha &quot;OK&quot;. Una nueva ventana de vista es creada, mostrando solo las otras copias de seguridad. Esta nueva vista te da una mejor idea del tama&ntilde;o requerido por cada copia de seguridad consecutiva. <a href="NavigatingViews.html">Navega y explora</a> esta vista para tener una mejor idea de que ha sido copiado. Si encuentras archivos que no deber&iacute;an ser copiados, actualiza las preferencias de tu M&aacute;quina del tiempo.</p>
<h2>Comprobar que archivos han sido copiados durante la &uacute;ltima copia de seguridad</h2>
<p>Inicia un <strong>Escaneo filtrado</strong>. Como carpeta para ser escaneada, escoge &quot;<em>Backup Volume</em>/Backups.backupdb/<em>My Computer</em>/Latest&quot;. Aplica el siguiente filtro: &quot;No mostrar: elementos de enlaces duros&quot;. El resultado es una vista que que muestra los archivos nuevos en la &uacute;ltima copia de seguridad. La vista excluye todo los archivos que aparecen en las anteriores copias de seguridad.</p>
<p>Nota: Puedes aplicar el mismo filtro a otras carpetas de copias de seguridad. Sin embargo, debes interpretar los datos en la vista de manera diferente. En este caso, cada archivo que se muestra no aparece en las copias de seguridad anteriores <em>y el contenido de la carpeta en la que aparece el archivo no ha cambiado en posteriores copias de seguridad mientras que el archivo haya existido (sin cambios)</em>. Es m&aacute;s, es un poco m&aacute;s dif&iacute;cil de hacerte una idea en la cabeza, y como resultado significativamente menos &uacute;til.</p>
</body>
</html>


 	  	 
