<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Vistas de navegaci&oacute;n</title>
<link href="HelpStyle.css" rel="stylesheet" media="all">
<meta name="description" content="Explica como cambiar el archivo selecionado y como cambiar la carpeta que es mostrada en la vista.">
<meta name="keywords" content="vistas, navegación, arriba, abajo, selección, bloquear, desbloquear, cambiar, carpeta" ></head>
<body>

<div id="caticon">
<img src="images/GrandPerspectiveIcon32.png" alt="GrandPerspective icon" height="32" width="32">
</div>
<div id="pagetitle">
<h1>Vistas de navegaci&oacute;n</h1>
</div>

<p>
Puedes seleccionar archivos en una <a href="Views.html">ventana de vista</a> pasando el puntero por encima de la vista con tu rat&oacute;n.
El archivo bajo el cursor del rat&oacute;n es seleccionado y marcado por un rect&aacute;ngulo iluminado;
las carpetas en las cuales el archivo reside son marcadas de manera similar.
El nombre y tama&ntilde;o del archivo selecionado son mostrados por debajo de la vista.
</p>

<p>
Puedes cambiar la selecci&oacute;n del archivo a una de las carpetas en las que reside (de esta manera, puedes, por ejemplo, averiguar rapidamente el tama&ntilde;o de carpetas especificas).
Puedes hacerlo mediante la <b>rueda</b> del rat&oacute;n, o usando las teclas "<b>[</b>" y "<b>]</b>" del teclado.
Despu&eacute;s de que hayas movido la selecci&oacute;n a un nivel en la jerarqu&iacute;a, se mantendr&aacute; en este nivel hasta que explicitamente la muevas arriba o abajo.
Si retornas la selecci&oacute;n a un archivo otra vez y vas un poco m&aacute;s all&aacute;, entonces la selecci&oacute;n se mantendr&aacute; en los archivos, como hac&iacute;a originalmente.</p>

<p>
Pinchando dentro de la vista bloqueas la selecci&oacute;n con lo que esta no cambia cuando mueves el rat&oacute;n.
Pinchando una vez m&aacute;s, en cualquier sitio de la vista, desbloqueas la selecci&oacute;n.</p>

<p>
Cuando la selecci&oacute;n est&aacute; bloqueada, puedes cambiar la carpeta que se es&aacute;¡ mostrando en la vista. 
Pinchando el bot&oacute;n <b>Abajo</b>, desciendes en la primera subcarpeta en la ruta del archivo seleccionado.
Puedes continuar bajando, hasta que hayas llegado al archivo en si mismo.
Pinchando <b>Arriba</b> te devolber&aacute; arriba, un nivel cada vez.</p>

<p> 
Cuando la selecci&oacute;n est&aacute; bloqueada, tambi&eacute;n puedes mostrar el archivo selecionado o la carpeta en el Finder usando el bot&oacute;n <strong>Mostrar</strong>. 
Entonces puedes examinarlo, renombrarlo, eliminarlo, etc.</p>

</body>
</html>

