<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Navegando por la vista</title>
<link href="HelpStyle.css" rel="stylesheet" media="all">
<meta name="description" content="Explica como puedes seleccionar un archivo y como cambiar la carpeta que es mostrada en la vista.">
<meta name="keywords" content="vistas, navegaci&oacute;n, arriba, abajo, selecci&oacute;n, bloquear, desbloquear, cambiar, carpeta, revelar, eliminar, borrar, supresi&oacute;n" >
</head>
<body>

<div id="caticon">
<img src="images/GrandPerspectiveIcon32.png" alt="GrandPerspective icon" height="32" width="32">
</div>
<div id="pagetitle">
<h1>Navegando en las vistas</h1>
</div>

<p>
Puedesseleccionar archivos en una <a href="Views.html">ventana de vista</a> pasando el puntero por encima de la vista con tu rat&oacute;n. El archivo bajo el cursor del rat&oacute;n es seleccionado y marcado por un rect&aacute;ngulo destacado; La carpeta en la que reside es marcada de forma similar. El nombre y tama&ntilde;o del archivo seleccionado es mostrado de bajo de la vista.</p>
<p>Puedes cambiar la selecci&oacute;n desde el archivo a una de las carpetas en las que reside (de esta manera puedes, por ejemplo, encontrar rapidamente el tama&ntilde;o de una carpeta espec&iacute;fica). Puedes hacerlo usando la <strong>rueda de desplazamiento</strong> del rat&oacute;n, o usando las teclas &quot;<strong>[</strong>&quot; y &quot;<strong>]</strong>&quot; del teclado. Despu&eacute;s de haber movido la selecci&oacute;n a un nivel en la jerarqu&iacute;a de un archivo, esta se mantiene en ese nivel hasta que la muevas arriba o abajo explicitamente. Si mueve la selecci&oacute;n otra vez abajo al archivo y vas un poco m&aacute;s all&aacute;, entonces la selecci&oacute;n se fijar&aacute; al archivo, como estaba originalmente.</p>
<p>Pinchando dentro de la vista bloquea la selecci&oacute;n para que as&iacute; no se cambie la selecci&oacute;n al mover el rat&oacute;n. Pincha una vez m&aacute;s, en cualquier parte de la vista, para desbloquear la selecci&oacute;n.</p>
<p>Cuando la selecci&oacute;n es bloqueada, puedes cambiar la carpeta que es mostrada en la vista. Pulsando el bot&oacute;n <strong>Abajo</strong>, puedes descender dentro de la primera subcarpeta de la ruta del archivo seleccionado. Puedes continuar bajando, hasta que hallas alcanzado el archivo en s&iacute;. Pinchando en <strong>Arriba</strong> te devolver&aacute; atr&aacute;s, un nivel cada vez.</p>
<p>Cuando la selecci&oacute;n es bloqueada, tambi&eacute;n puedes mostrar el archivo o carpeta seleccionado en el Finder usando el bot&oacute;n <strong>Revelar</strong>. Entonces puedes examinarlo, renombrarlo, moverlo, etc.</p>
<p>Cuando la selecci&oacute;n est&aacute; bloqueada, puedes eliminar el archivo o carpeta seleccionado usando el bot&oacute;n <strong>Eliminar</strong>. Los elementos eliminados ser&aacute;n movidos a la Papelera y la vista ser&aacute; actualizada para mostrar el espacio liberado. Por defecto, el bot&oacute;n est&aacute; desactivado para reducir la posibilidad de borrar un archivo accidentalmente. La eliminaci&oacute;n puede ser habilitada desde las <a href="Preferences.html">Preferencias</a>.</p>
<!-- Note: warning repeated in Preferences.html -->
<p><em>Cuidado: Eliminar carpetas mover&aacute; la carpeta entera a la Papelera, incluso cualquier archivo en la carpeta que no sea mostrado en la vista. Un archivo puede no ser mostrado porque halla sido <a href="MasksAndFilters.html">enmascarado o filtrado</a>, puede no haber sido escaneado porque no se ten&iacute;an suficientes permisos, o halla aparecido despu&eacute;s de que escaneo fuera realizado. Resumiendo, debes ser muy cuidadoso cuando elimines carpetas.</em></p>
</body>
</html>

