<html lang="es">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Navegando por las vistas</title>
<link href="HelpStyle.css" rel="stylesheet" media="all">
<meta name="description" content="Explica como cambiar el archivo seleccionado y como cambiar la carpeta que es mostrada en la vista.">
<meta name="keywords" content="vista, navegación, zoom, foco, selección, seleccionar, bloquear, desbloquear, cambiar, carpeta, abrir, revealar, mostrar, eliminar, eliminación" >
</head>
<body>

<div id="caticon">
<img src="images/GrandPerspectiveIcon32.png" alt="GrandPerspective icon" height="32" width="32">
</div>
<div id="pagetitle">
<h1>Navegando por las vistas</h1>
</div>

<p>
Puedes seleccionar los archivos en una <a href="Views.html">ventana de la vista</a> pasando por encima de la vista con tu rat&oacute;n. El archivo bajo el rat&oacute;n se selecciona y marca con un rect&aacute;ngulo iluminado; las carpetas en las que reside el archivo son marcadas de forma similar. El nombre y el tama&ntilde;o del archivo seleccionado son mostrados por debajo de la vista.</p>
<h2>Cambiando el foco</h2>

<p>
Puedes mover la selecci&oacute;n desde el archivo auna de las carpetas en las que reside cambiando el foco. De esta manera, puedes, por ejemplo, encontrar rapidamente el tama&ntilde;o de carpetas espec&iacute;ficas. Puedes cambiar el foco usando:</p>
<ul>
<li>el control <b>Foco</b> en la barra de herramientas,</li>
<li>la <b>rueda del rat&oacute;n</b>,</li>
<li>o las teclas  "<b>[</b>" y "<b>]</b>" de tu teclado.</li>
</ul>
<p>Cuando cambias el foco, se mantiene en ese nivel en la jerarqu&iacute;a del archivo hasta que tu o muevas arriba o abajo explicitamente. Si muves el foco hacia abajo de nuevo al archivo, la selecci&oacute;n se mantendr&aacute; en el archivo otra vez, independientemente del nivel en la jerarqu&iacute;a del archivo, como &eacute;l estaba originalmente.</p>
<h2>Bloqueando y desbloqueando la selecci&oacute;n</h2>
<p>Pinchando dentro de la vista bloquea la selecci&oacute;n para que no cambie cuando muevas el rat&oacute;n. Pinchando una vez m&aacute;s, en cualquier sitio de la vista, desbloqueas la selecci&oacute;n.</p>
<h2>Haciendo y quitando zoom</h2>

<p>Cuando la selecci&oacute;n est&aacute; bloqueada puedes hacer y quitar zoom usando los controles de <b>Zoom</b> en la barra de herramientas. Esto cambia la carpeta qe es mostrada en la vista. Haciendo zoom, puedes descender en la primera subcarpeta en la ruta del archivo seleccionado. Puedes continuar haciendo zoom, hasta que alcances al archivo en s&iacute; mismo. Quitando zoom te devolver&aacute; arriba otra vez, un nivel cada vez.</p>
<h2>Acciones</h2>

<p> 
Cuando la selecci&oacute;n est&aacute; bloqueada tambi&eacute;n puedes usar la barra de herramientas para aplicar las siguientes acciones al archivo o carpeta seleccionado:</p>
<ul>
<li>
  <p>
<b>Abrir</b> abre el archivo seleccionado usando el programa por defecto que est&aacute; asociado con &eacute;l en el Finder.</p>
</li>

<li>
  <p>
<b>Mostrar</b> muestra el archivo o carpeta seleccionado en el Finder. All&iacute; puedes examinarlo, ver informaci&oacute;n m&aacute;s detallada, renombrarlo, moverlo, etc.</p>
</li>

<li>
<p>
<b>Eliminar</b> mueve el archivo o carpeta seleccionado a la Papelera.
La vista ser&aacute; actualizada para mostrar el espacio liberado. Por defecto, el control est&aacute; desactivado para reducir la posibilidades de borrar por accidente un archivo.
La eliminaci&oacute;n puede ser activada desde las <a href="Preferences.html">Preferencias</a>.</p>

<p>
<!-- Note: warning repeated in Preferences.html -->
<em>Se cuidadoso: Eliminando carpetas mover&aacute;s la carpeta entera a la Papelera, incluyendo cualquier archivo en la carpeta que no se muestre en la vista. Un archivo puede no mostrarse devido a que est&eacute; </em><em><a href="MasksAndFilters.html">enmascarado or filtrado</a>, puede no haber sido escaneado porque no se tengan suficientes permisos, o que haya aparecido en la carpeta despu&eacute;s de que se hiciera el escaneo. En pocas palabras, debes tener mucho cuidado cuando elimines carpetas.</em></p>
</li>
</ul>

</body>
</html>

