<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Preferencias de usuario</title>
<link href="HelpStyle.css" rel="stylesheet" media="all">
<meta name="description" content="Describe las preferencias del usuario.">
<meta name="keywords" content="preferencias, eliminaci&oacute;n, defecto, opciones, configuraci&oacute;n, personalizar, adaptar, personalizaci&oacute;n, adaptaci&oacute;n" >
</head>
<body>

<div id="caticon">
<img src="images/GrandPerspectiveIcon32.png" alt="GrandPerspective icon" height="32" width="32">
</div>
<div id="pagetitle">
<h1>Preferencias</h1>
</div>

<p>
La aplicaci&oacute;n puede ser personalizado usando el comando Preferencias, accesible desde el men&uacute; GrandPerspective. El Panel de preferencias consiste de tres partes: Acciones, Informaci&oacute;n, y Visualizaci&oacute;n.</p>

<p>
En la secci&oacute;n <strong>Acciones</strong>, puedes configurar si es soportada la eliminaci&oacute;n de archivos en la <a href="Views.html">ventana de la vista</a>. Puedes desactivar la eliminaci&oacute;n, permitir la eliminaci&oacute;n de un &uacute;nico archivo, o permitir el borrado de carpetas enteras. Adem&aacute;s, puedes especificar si es requerida una confirmaci&oacute;n.</p>
<!-- Note: warning repeated in NavigatingViews.html -->
<p>
<em>Cuidado: Eliminar carpetas mover&aacute; la carpeta entera a la Papelera, incluso cualquier archivo en la carpeta que no sea mostrado en la vista. Un archivo puede no ser mostrado porque halla sido <a href="MasksAndFilters.html">enmascarado o filtrado</a>, puede no haber sido escaneado porque no se ten&iacute;an suficientes permisos, o halla aparecido despu&eacute;s de que escaneo fuera realizado. Resumiendo, debes ser muy cuidadoso cuando elimines carpetas.</em></p>

<p>
En la secci&oacute;n de <strong>Informaci&oacute;n</strong> puedes configurar la <a href="FileSizeMeasures.html">medida de tama&ntilde;o de archivo</a> que es usada para informar de los tama&ntilde;os de archivo. Un cambio a esta opci&oacute;n tendr&aacute; efecto cuando sean escaneadas nuevas carpetas. No afectar&aacute; a las vistas existentes, o las vistas que son <a href="CreatingViews.html">creadas</a> despu&eacute;s de re-escanear (ya que la &uacute;ltima toma sus opciones de la original). La medida de tama&ntilde;o de archivo que es usada por una ventana de vista especifica se puede encontrar en su <a href="ViewInfoPanel.html">Panel de informaci&oacute;n</a>.</p>
<p>La secci&oacute;n de <strong>Visualizaci&oacute;n</strong> contiene la configuraci&oacute;n que afecta a la apariencia de las vistas. Aqu&iacute; puedes especificar el mapa de color y la paleta de colores que es usada para las nuevas vistas. Mediante la <a href="EditingFileTypeColorMapping.html">edici&oacute;n del mapa de color del "Tipo de archivo"</a> puedes controlar como son mapeados los tipos de archivo a los diferentes colores. Los cambios de estas opciones afectan a todas las vistas que usan la coloraci&oacute;n por tipo de archivo. Tambi&eacute;n puedes especificar si los contenidos de los paquetes deben ser mostrados en las nuevas vistas creadas. La mayor&iacute;a de estas opciones solo especifican el aspecto inicial de las nuevas vistas creadas. Posteriormente puedes cambiar la apariencia de una vista usando su <a href="ViewDisplayPanel.html">Panel de visualizaci&oacute;n</a>.</p>
</body>
</html>

