<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Guardando los datos de la vista</title>
<link href="HelpStyle.css" rel="stylesheet" media="all">
<meta name="description" content="Describe como guardar los datos que son mostrados en la vista.">
<meta name="keywords" content="vista, guardar, cargar, imagen">
</head>
<body>

<div id="caticon">
<img src="images/GrandPerspectiveIcon32.png" alt="GrandPerspective icon" height="32" width="32">
</div>
<div id="pagetitle">
<h1>Guardando los resultados de un escaneo</h1>
</div>

<p>
Hay dos formas con las que puedes guardar los contenidos de las <a href="Views.html">vistas</a>, a ambos se accede desde el men&uacute; &quot;Archivo&quot;:
<ul>
<li>
<p>El comando <strong>Guardar datos del escaneo</strong> te permite guardar todos los datos de la vista. Los datos son guardados en un archivo XML. No importa que carpeta es mostrada actualmente en la vista. Todos los archivos &#151;tambi&eacute;n los que no se muestran en la vista&#151; son guardados. Sin embargo, si un <a href="MasksAndFilters.html">filtro</a> ha sido usado para crear la vista, entonces los archivos que han sido excluidos por el filtro no ser&aacute;n guardados.</p>
</li>

<li>Los datos guardados pueden ser cargados en <a href="CreatingViews.html">una nueva vista</a> en un momento posterior usando el comando <strong>Cargar datos del escaneo</strong>. Guardar y cargar los datos es &uacute;til por varias razones, entre las cuales las siguientes:
  <ul>
    <li>Puedes <a href="NavigatingViews.html">ver y navegar</a> por antiguos contenidos de carpetas, incluso cuando estos han cambiado actualmente. Comparando los antiguos contenidos de una carpeta con los actuales puede ser &uacute;til para determinar porque el espacio del disco ha desaparecido bruscamente. Nota: Si est&aacute;s usando la M&aacute;quina del Tiempo, puedes ver tambi&eacute;n el contenido antiguo de las carpetas <a href="HowToAnalyseTimeMachineBackups.html">escaneando las copias de seguridad antiguas de la m&aacute;quina del tiempo</a>.</li>
    <li>Puedes visualizar tu disco duro usando GrandPerspective en otra m&aacute;quina.</li>
    <li>
      Cargar los datos de escaneo guardados es m&aacute;s r&aacute;pido que obtener los mismos datos escaneando la carpeta otra vez.</li>
    <li>Los usuarios experimentados pueden procesar, analizar, y manipular los datos guardados usando shell scripts u otras utilidades.</li>
    </ul>
  </p>
  
    <p><em>Cuidado: Cuando est&eacute;s viendo los datos cargados, tienes que tener un cuidado extra al usar el comando <strong>Eliminar</strong>. </em>Los archivos y carpetas que has seleccionado para borrar pueden tener diferentes contenidos que los que la vista sugiere; las carpetas pueden contener m&aacute;s archivos y los archivos pueden haber cambiado (en tama&ntilde;o) tambi&eacute;n.</p>
</li>
<li>
<p>
El comando <strong>Guardar imagen de la vista</strong> puede ser usado para guardar una imagen PNG de la vista. La imagen ser&aacute; dibujada usando la configuraci&oacute;n de <a href="ViewDisplayPanel.html">Visualizaci&oacute;n</a> de la vista y mostrar&aacute; la misma carpeta. La imagen es un representaci&oacute;n est&aacute;tica de los datos en la vista; no puede ser cargada en GrandPerspective de nuevo para una posterior exploraci&oacute;n. Puedes, sin embargo, cargar la imagen en tu blog, enviarlo por email a tus amigos, o enmarcarlo y colgar en la pared de tu cuarto :-).</p>
</li>
</ul>
</body>
</html>
