<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>The view's Display panel</title>
<link href="HelpStyle.css" rel="stylesheet" media="all">
<meta name="description" content="Describes the view's Display panel and explains how to change the view's appearance.">
<meta name="keywords" content="GrandPerspective, vista, pestaña, ventana, visualización, panel, color, paleta, extensión, máscara, volumen" >
</head>
<body>

<div id="caticon">
<img src="images/GrandPerspectiveIcon32.png" alt="GrandPerspective icon" height="32" width="32">
</div>
<div id="pagetitle">
<h1>The view's Display panel</h1>
</div>

<p>La pesta&ntilde;a de visualizaci&oacute;n en el <a href="ViewDrawer.html">panel de la vista</a> te permite cambiar como es dibujada la <a href="Views.html">vista</a>.

Puedes elegir varias opciones de colorear los archivos: 
<ul>


  <li><strong>Profundidad</strong>: 
    El n&uacute;mero de subcarpetas en la ruta de cada archivo, respecto a la carpeta que es actualmente mostrada en la vista, determina el color. Todos los archivos con la misma &quot;profundidad&quot; tienen el mismo color.</li>
  <li> <b>Extensi&oacute;n</b>: 
    Todos los archivos con la misma extensi&oacute;n tienen el mismo color.</li>
  <li><strong>Carpeta</strong>: 
    Todos los archivos de la misma carpeta tienen el mismo color.</li>
  <li> <b>Nombre</b>: 
    Los archivos con el mismo nombre tendr&aacute;n el mismo color.</li>
  <li> <b>Nada</b>:
    Todos los archivos tendr&aacute;n el mismo color.</li>
  <li><strong>Carpeta superior</strong>:
    La primera subcarpeta en la ruta de cada archivo, relativa a la carpeta que est&aacute; actualmente mostrandose en la vista, determina el color.
    Todos los archivos que aparecen en la misma &quot;carpeta superior&quot; tienen el mismo color.</li>
</ul>
<p> Parecido a esto, puedes tambi&eacute;n escoger entre las variadas paletas de colores que son suministradas con la aplicaci&oacute;n. Solamente escoge una que te venga bien para tus gustos.</p>
<p>Puedes tambi&eacute;n configurar una <a href="MasksAndFilters.html">m&aacute;scara</a>. 
Cuando uses una m&aacute;scara, solo ciertos archivos son mostrados. Archivos que son enmascarados, por otro lado, seguir&aacute;n ocupando espacio pero no ser&aacute;n dibujados. Enmascarar puede ser &uacute;til para identificar rapidamente ciertos (tipos de) archivos, y tambi&eacute;n puede ser un paso &uacute;til antes de aplicar un <a href="MasksAndFilters.html">filtro</a>.Presiona el bot&oacute;n <b>Editar</b> para empezar a <a href="EditingMasksAndFilters.html">editar la m&aacute;scara</a>.</p> 

<p>Por defecto, la visa solo muestra los archivos que han sido escaneados (o un subconjunto del mismo). Sin embargo, puedes elegir mostrar el volumen entero. Activando esta configuraci&oacute;n, la vista tambi&eacute; muestra el espacio libre y el espacio de uso variado. Nota, si el tama&ntilde;o total de los archivos escaneados es peque&ntilde;o comparado con el tama&ntilde;o del conjunto del volumen entonces la vista no ser&aacute; muy interesante. En este caso, es mejor que desabilites la opci&oacute;n &quot;Mostrar el volumen entero&quot; otra vez. Alternativamente, puedes escanear la carpeta raiz del volumen, si no lo has hecho a&uacute;n.</p>
</body>
</html>

