<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Creando vistas</title>
<link href="HelpStyle.css" rel="stylesheet" media="all">
<meta name="description" content="Enumera todas las formas de crear vistas en GrandPerspective.">
<meta name="keywords" content="GrandPerspective, vistas, crear, escanear, reescanear, filtro, filtrar">
</head>
<body>

<div id="caticon">
<img src="images/GrandPerspectiveIcon32.png" alt="GrandPerspective icon" height="32" width="32">
</div>
<div id="pagetitle">
<h1>Creando vistas</h1>
</div>

<p>
Cuando la aplicaci&oacute;n comienza, te pregunta para que selecciones una carpeta. 
Despu&eacute;s de haber seleccionado una carpeta, la carpeta es escaneada para determinar el tama&ntilde;o de todos los archivos en ella (incluyendo los archivos en subcarpetas). 
Una vez el escaneo a terminado un  mapa de &aacute;rbol de la carpeta escaneada es mostrada en una nueva <a href="Views.html">ventana de vista</a>.</p>

<p>
Hay otroscaminos variado con los que puedes crear una vista:

<ul>

<li>
El comando <b>Escanear carpeta...</b> del men&uacute; &quot;Archivo&quot; te permite escanear otra carpeta.</li>

<li>El comando <b>Re-escanear</b> del men&uacute; &quot;Archivo&quot; te permite generar una versi&oacute;n actualizada de la vista actual. 
Esto es &uacute;til cuando el contenido de la carpeta ha cambiado, por ejemplo porque as borrado uno o m&aacute;s archivos. 
La nueva vista usar&aacute; la misma configuraci&oacute;n que la vista actual.</li>

<li>El comando <b>Duplicar</b> del men&uacute; &quot;Ventanas&quot;  te permite duplicar la ventana actual. 
Una nueva vista es creada similar a la actual. 
Puedes cambiar la configuraci&oacute;n de visualizaci&oacute;n para ver el mapa de &aacute;rbol de varias formas diferentes a la vez.</li>

<li>El comando <b>Clonar </b>del men&uacute; &quot;Ventanas&quot; te permite clonar la ventana actual. Clonar una vista es muy similar a duplicar la, excepto que la navegaci&oacute;n est&aacute; sincronizada tambi&eacute;n (lo que hagas en una ocurre en la otra).</li>

<li>El comando <b>Filtrar...</b> del men&uacute; &quot;Ventanas&quot;  te permite aplicar un  <a href="MasksAndFilters.html">filtro</a> a la vista actual.</li>

</ul>
</p>

</body>
</html>

